; domain
(define (domain towerofhanoi)
	(:predicates
		(clear ?a)
		(smaller ?a ?b)
		(on ?a ?b))
	(:action movedisk :parameters (?disk ?from ?to)
		 :precondition (and (clear ?disk)
		 	       	    (smaller ?disk ?to)
			       	    (on ?disk ?from)
			       	    (clear ?to))
		 :effect (and (on ?disk ?to)
		 	      (clear ?from)
			      (not (on ?disk ?from))
			      (not (clear ?to)))))

; problem
(define (problem threepegsfourdisks)
	(:domain towerofhanoi)
	(:objects peg1 peg2 peg3 disk1 disk2 disk3 disk4)
	(:init (on disk1 peg1)
	       (on disk2 disk1)
	       (on disk3 disk2)
	       (on disk4 disk3)
	       (clear disk4)
	       (clear peg2)
	       (clear peg3)
	       (smaller disk4 disk3)
	       (smaller disk4 disk2)
	       (smaller disk4 disk1)
	       (smaller disk3 disk2)
	       (smaller disk3 disk1)
	       (smaller disk2 disk1)
	       (smaller disk1 peg1) (smaller disk1 peg2) (smaller disk1 peg3)
	       (smaller disk2 peg1) (smaller disk2 peg2) (smaller disk2 peg3)
	       (smaller disk3 peg1) (smaller disk3 peg2) (smaller disk3 peg3)
	       (smaller disk4 peg1) (smaller disk4 peg2) (smaller disk4 peg3))
	       (:goal (and (on disk4 disk3)
	       	      (on disk3 disk2)
	       	      (on disk2 disk1)
		      (on disk1 peg3))))

; plan
1. (movedisk disk4 disk3 peg2)
   deleted: (on disk4 disk3) (clear peg2)
   added: (on disk4 peg2) (clear disk3)
   goals met: 2 of 4
2. (movedisk disk3 disk2 peg3)
   deleted: (on disk3 disk2) (clear peg3)
   added: (on disk3 peg3) (clear disk2)
   goals met: 1 of 4
3. (movedisk disk4 peg2 disk3)
   deleted: (on disk4 peg2) (clear disk3)
   added: (on disk4 disk3) (clear peg2)
   goals met: 2 of 4
4. (movedisk disk2 disk1 peg2)
   deleted: (on disk2 disk1) (clear peg2)
   added: (on disk2 peg2) (clear disk1)
   goals met: 1 of 4
5. (movedisk disk4 disk3 disk1)
   deleted: (on disk4 disk3) (clear disk1)
   added: (on disk4 disk1) (clear disk3)
   goals met: 0 of 4
6. (movedisk disk3 peg3 disk2)
   deleted: (on disk3 peg3) (clear disk2)
   added: (on disk3 disk2) (clear peg3)
   goals met: 1 of 4
7. (movedisk disk4 disk1 disk3)
   deleted: (on disk4 disk1) (clear disk3)
   added: (on disk4 disk3) (clear disk1)
   goals met: 2 of 4
8. (movedisk disk1 peg1 peg3)
   deleted: (on disk1 peg1) (clear peg3)
   added: (on disk1 peg3) (clear peg1)
   goals met: 3 of 4
9. (movedisk disk4 disk3 disk1)
   deleted: (on disk4 disk3) (clear disk1)
   added: (on disk4 disk1) (clear disk3)
   goals met: 2 of 4
10. (movedisk disk3 disk2 peg1)
   deleted: (on disk3 disk2) (clear peg1)
   added: (on disk3 peg1) (clear disk2)
   goals met: 1 of 4
11. (movedisk disk4 disk1 disk3)
   deleted: (on disk4 disk1) (clear disk3)
   added: (on disk4 disk3) (clear disk1)
   goals met: 2 of 4
12. (movedisk disk2 peg2 disk1)
   deleted: (on disk2 peg2) (clear disk1)
   added: (on disk2 disk1) (clear peg2)
   goals met: 3 of 4
13. (movedisk disk4 disk3 peg2)
   deleted: (on disk4 disk3) (clear peg2)
   added: (on disk4 peg2) (clear disk3)
   goals met: 2 of 4
14. (movedisk disk3 peg1 disk2)
   deleted: (on disk3 peg1) (clear disk2)
   added: (on disk3 disk2) (clear peg1)
   goals met: 3 of 4
15. (movedisk disk4 peg2 disk3)
   deleted: (on disk4 peg2) (clear disk3)
   added: (on disk4 disk3) (clear peg2)
   goals met: 4 of 4
